<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"deb9ec70625fdd0e85b523def0707c5a0b3020a694b8e213a37bd5e0a906bfeb","plan_job_ref":"Job Infrastructure #373 at https://github.com/coverage-robot/core/actions/runs/8161700633","plan_out_hash":"1208476eee0b131dc22e62a9de1a56f25e800f07bfdb8938e62a08b21babd46f","plan_hash":"9af4453ca822035855d95a300e7c118885dd584addb9b02f090f2f8800f27d45","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.events.aws_iam_policy.coverage_event_scheduler_policy will be created
+   resource "aws_iam_policy" "coverage_event_scheduler_policy" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "coverage-event-scheduler-policy-prod"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "events:PutEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           {
+                               arn               = "arn:aws:events:eu-west-2:952005856579:event-bus/coverage-events-prod"
+                               event_source_name = null
+                               id                = "coverage-events-prod"
+                               name              = "coverage-events-prod"
+                               tags              = {}
+                               tags_all          = {}
                            },
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.events.aws_iam_role_policy_attachment.coverage_event_scheduler_policy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "coverage_event_scheduler_policy_attachment" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "coverage-event-scheduler-role-prod"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!~  line_coverage_table       = {
        id                          = "projects/coverage-384615/datasets/prod/tables/line_coverage"
!~      last_modified_time          = 1709665044078 -> 1709665275308
!~      num_bytes                   = 1843493459974 -> 1843560996353
!~      num_rows                    = 4297511102 -> 4297693171
#        (27 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #373](https://github.com/coverage-robot/core/actions/runs/8161700633)